hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_qeiv2_regs.h
/*
 * RSTCNT (RW)
 *
 * 1- reset zcnt, spdcnt and tmrcnt to 0. reset phcnt to phidx
 */
#define QEIV2_CR_RSTCNT_MASK (0x10U)
#define QEIV2_CR_RSTCNT_SHIFT (4U)
#define QEIV2_CR_RSTCNT_SET(x) (((uint32_t)(x) << QEIV2_CR_RSTCNT_SHIFT) & QEIV2_CR_RSTCNT_MASK)
#define QEIV2_CR_RSTCNT_GET(x) (((uint32_t)(x) & QEIV2_CR_RSTCNT_MASK) >> QEIV2_CR_RSTCNT_SHIFT)

/*
 * RD_SEL (RW)
 *
 * define the width/counter value(affect width_match, width_match2, width_cur, timer_cur, width_read, timer_read,
 * width_snap0,width_snap1, timer_snap0, timer_snap1)
 * 0 : same as hpm1000/500/500s;
 * 1: use width for position; use timer for angle
 */
#define QEIV2_CR_RD_SEL_MASK (0x8U)
#define QEIV2_CR_RD_SEL_SHIFT (3U)
#define QEIV2_CR_RD_SEL_SET(x) (((uint32_t)(x) << QEIV2_CR_RD_SEL_SHIFT) & QEIV2_CR_RD_SEL_MASK)
#define QEIV2_CR_RD_SEL_GET(x) (((uint32_t)(x) & QEIV2_CR_RD_SEL_MASK) >> QEIV2_CR_RD_SEL_SHIFT)

/*
 * ENCTYP (RW)
 *
 * 000-abz; 001-pd; 010-ud; 011-UVW(hal)
 * 100-single A; 101-single sin;  110: sin&cos
 */
#define QEIV2_CR_ENCTYP_MASK (0x7U)
#define QEIV2_CR_ENCTYP_SHIFT (0U)
#define QEIV2_CR_ENCTYP_SET(x) (((uint32_t)(x) << QEIV2_CR_ENCTYP_SHIFT) & QEIV2_CR_ENCTYP_MASK)
#define QEIV2_CR_ENCTYP_GET(x) (((uint32_t)(x) & QEIV2_CR_ENCTYP_MASK) >> QEIV2_CR_ENCTYP_SHIFT)

/* Bitfield definition for register: PHCFG */
/*
 * PHMAX (RW)
 *
 * maximum phcnt number, phcnt will rollover to 0 when it upcount to phmax
 */
#define QEIV2_PHCFG_PHMAX_MASK (0xFFFFFFFFUL)
#define QEIV2_PHCFG_PHMAX_SHIFT (0U)
#define QEIV2_PHCFG_PHMAX_SET(x) (((uint32_t)(x) << QEIV2_PHCFG_PHMAX_SHIFT) & QEIV2_PHCFG_PHMAX_MASK)
#define QEIV2_PHCFG_PHMAX_GET(x) (((uint32_t)(x) & QEIV2_PHCFG_PHMAX_MASK) >> QEIV2_PHCFG_PHMAX_SHIFT)

/* Bitfield definition for register: WDGCFG */
/*
 * WDGEN (RW)
 *
 * 1- enable wdog counter
 */
#define QEIV2_WDGCFG_WDGEN_MASK (0x80000000UL)
#define QEIV2_WDGCFG_WDGEN_SHIFT (31U)
#define QEIV2_WDGCFG_WDGEN_SET(x) (((uint32_t)(x) << QEIV2_WDGCFG_WDGEN_SHIFT) & QEIV2_WDGCFG_WDGEN_MASK)
#define QEIV2_WDGCFG_WDGEN_GET(x) (((uint32_t)(x) & QEIV2_WDGCFG_WDGEN_MASK) >> QEIV2_WDGCFG_WDGEN_SHIFT)

/*
 * WDOG_CFG (RW)
 *
 * define as stop if phase_cnt change is less than it
 * if 0, then each change of phase_cnt will clear wdog counter;
 * if 2, then phase_cnt change larger than 2 will clear wdog counter
 */
#define QEIV2_WDGCFG_WDOG_CFG_MASK (0x70000000UL)
#define QEIV2_WDGCFG_WDOG_CFG_SHIFT (28U)
#define QEIV2_WDGCFG_WDOG_CFG_SET(x) (((uint32_t)(x) << QEIV2_WDGCFG_WDOG_CFG_SHIFT) & QEIV2_WDGCFG_WDOG_CFG_MASK)
#define QEIV2_WDGCFG_WDOG_CFG_GET(x) (((uint32_t)(x) & QEIV2_WDGCFG_WDOG_CFG_MASK) >> QEIV2_WDGCFG_WDOG_CFG_SHIFT)

/*
 * WDGTO (RW)
 *
 * watch dog timeout value
 */
#define QEIV2_WDGCFG_WDGTO_MASK (0xFFFFFFFUL)
#define QEIV2_WDGCFG_WDGTO_SHIFT (0U)
#define QEIV2_WDGCFG_WDGTO_SET(x) (((uint32_t)(x) << QEIV2_WDGCFG_WDGTO_SHIFT) & QEIV2_WDGCFG_WDGTO_MASK)
#define QEIV2_WDGCFG_WDGTO_GET(x) (((uint32_t)(x) & QEIV2_WDGCFG_WDGTO_MASK) >> QEIV2_WDGCFG_WDGTO_SHIFT)

/* Bitfield definition for register: PHIDX */
/*
 * PHIDX (RW)
 *
 * phcnt reset value, phcnt will reset to phidx when phcaliz set to 1
 */
#define QEIV2_PHIDX_PHIDX_MASK (0xFFFFFFFFUL)
#define QEIV2_PHIDX_PHIDX_SHIFT (0U)
#define QEIV2_PHIDX_PHIDX_SET(x) (((uint32_t)(x) << QEIV2_PHIDX_PHIDX_SHIFT) & QEIV2_PHIDX_PHIDX_MASK)
#define QEIV2_PHIDX_PHIDX_GET(x) (((uint32_t)(x) & QEIV2_PHIDX_PHIDX_MASK) >> QEIV2_PHIDX_PHIDX_SHIFT)

/* Bitfield definition for register: TRGOEN */
/*
 * WDGFEN (RW)
 *
 * 1- enable trigger output when wdg flag set
 */
#define QEIV2_TRGOEN_WDGFEN_MASK (0x80000000UL)
#define QEIV2_TRGOEN_WDGFEN_SHIFT (31U)
#define QEIV2_TRGOEN_WDGFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_WDGFEN_SHIFT) & QEIV2_TRGOEN_WDGFEN_MASK)
#define QEIV2_TRGOEN_WDGFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_WDGFEN_MASK) >> QEIV2_TRGOEN_WDGFEN_SHIFT)

/*
 * HOMEFEN (RW)
 *
 * 1- enable trigger output when homef flag set
 */
#define QEIV2_TRGOEN_HOMEFEN_MASK (0x40000000UL)
#define QEIV2_TRGOEN_HOMEFEN_SHIFT (30U)
#define QEIV2_TRGOEN_HOMEFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_HOMEFEN_SHIFT) & QEIV2_TRGOEN_HOMEFEN_MASK)
#define QEIV2_TRGOEN_HOMEFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_HOMEFEN_MASK) >> QEIV2_TRGOEN_HOMEFEN_SHIFT)

/*
 * POSCMPFEN (RW)
 *
 * 1- enable trigger output when poscmpf flag set
 */
#define QEIV2_TRGOEN_POSCMPFEN_MASK (0x20000000UL)
#define QEIV2_TRGOEN_POSCMPFEN_SHIFT (29U)
#define QEIV2_TRGOEN_POSCMPFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_POSCMPFEN_SHIFT) & QEIV2_TRGOEN_POSCMPFEN_MASK)
#define QEIV2_TRGOEN_POSCMPFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_POSCMPFEN_MASK) >> QEIV2_TRGOEN_POSCMPFEN_SHIFT)

/*
 * ZPHFEN (RW)
 *
 * 1- enable trigger output when zphf flag set
 */
#define QEIV2_TRGOEN_ZPHFEN_MASK (0x10000000UL)
#define QEIV2_TRGOEN_ZPHFEN_SHIFT (28U)
#define QEIV2_TRGOEN_ZPHFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_ZPHFEN_SHIFT) & QEIV2_TRGOEN_ZPHFEN_MASK)
#define QEIV2_TRGOEN_ZPHFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_ZPHFEN_MASK) >> QEIV2_TRGOEN_ZPHFEN_SHIFT)

/*
 * ZMISSFEN (RW)
 *
 */
#define QEIV2_TRGOEN_ZMISSFEN_MASK (0x8000000UL)
#define QEIV2_TRGOEN_ZMISSFEN_SHIFT (27U)
#define QEIV2_TRGOEN_ZMISSFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_ZMISSFEN_SHIFT) & QEIV2_TRGOEN_ZMISSFEN_MASK)
#define QEIV2_TRGOEN_ZMISSFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_ZMISSFEN_MASK) >> QEIV2_TRGOEN_ZMISSFEN_SHIFT)

/*
 * WIDTHTMFEN (RW)
 *
 */
#define QEIV2_TRGOEN_WIDTHTMFEN_MASK (0x4000000UL)
#define QEIV2_TRGOEN_WIDTHTMFEN_SHIFT (26U)
#define QEIV2_TRGOEN_WIDTHTMFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_WIDTHTMFEN_SHIFT) & QEIV2_TRGOEN_WIDTHTMFEN_MASK)
#define QEIV2_TRGOEN_WIDTHTMFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_WIDTHTMFEN_MASK) >> QEIV2_TRGOEN_WIDTHTMFEN_SHIFT)

/*
 * POS2CMPFEN (RW)
 *
 */
#define QEIV2_TRGOEN_POS2CMPFEN_MASK (0x2000000UL)
#define QEIV2_TRGOEN_POS2CMPFEN_SHIFT (25U)
#define QEIV2_TRGOEN_POS2CMPFEN_SET(x) (((uint32_t)(x) << QEIV2_TRGOEN_POS2CMPFEN_SHIFT) & QEIV2_TRGOEN_POS2CMPFEN_MASK)
#define QEIV2_TRGOEN_POS2CMPFEN_GET(x) (((uint32_t)(x) & QEIV2_TRGOEN_POS2CMPFEN_MASK) >> QEIV2_TRGOEN_POS2CMPFEN_SHIFT)

