hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_qeiv2_regs.h
/*
 * PULSE0FEN (RW)
 *
 */
#define QEIV2_READEN_PULSE0FEN_MASK (0x200000UL)
#define QEIV2_READEN_PULSE0FEN_SHIFT (21U)
#define QEIV2_READEN_PULSE0FEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_PULSE0FEN_SHIFT) & QEIV2_READEN_PULSE0FEN_MASK)
#define QEIV2_READEN_PULSE0FEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_PULSE0FEN_MASK) >> QEIV2_READEN_PULSE0FEN_SHIFT)

/*
 * PULSE1FEN (RW)
 *
 */
#define QEIV2_READEN_PULSE1FEN_MASK (0x100000UL)
#define QEIV2_READEN_PULSE1FEN_SHIFT (20U)
#define QEIV2_READEN_PULSE1FEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_PULSE1FEN_SHIFT) & QEIV2_READEN_PULSE1FEN_MASK)
#define QEIV2_READEN_PULSE1FEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_PULSE1FEN_MASK) >> QEIV2_READEN_PULSE1FEN_SHIFT)

/*
 * HOME2FEN (RW)
 *
 */
#define QEIV2_READEN_HOME2FEN_MASK (0x80000UL)
#define QEIV2_READEN_HOME2FEN_SHIFT (19U)
#define QEIV2_READEN_HOME2FEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_HOME2FEN_SHIFT) & QEIV2_READEN_HOME2FEN_MASK)
#define QEIV2_READEN_HOME2FEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_HOME2FEN_MASK) >> QEIV2_READEN_HOME2FEN_SHIFT)

/*
 * FAULTFEN (RW)
 *
 */
#define QEIV2_READEN_FAULTFEN_MASK (0x40000UL)
#define QEIV2_READEN_FAULTFEN_SHIFT (18U)
#define QEIV2_READEN_FAULTFEN_SET(x) (((uint32_t)(x) << QEIV2_READEN_FAULTFEN_SHIFT) & QEIV2_READEN_FAULTFEN_MASK)
#define QEIV2_READEN_FAULTFEN_GET(x) (((uint32_t)(x) & QEIV2_READEN_FAULTFEN_MASK) >> QEIV2_READEN_FAULTFEN_SHIFT)

/* Bitfield definition for register: ZCMP */
/*
 * ZCMP (RW)
 *
 * zcnt postion compare value
 */
#define QEIV2_ZCMP_ZCMP_MASK (0xFFFFFFFFUL)
#define QEIV2_ZCMP_ZCMP_SHIFT (0U)
#define QEIV2_ZCMP_ZCMP_SET(x) (((uint32_t)(x) << QEIV2_ZCMP_ZCMP_SHIFT) & QEIV2_ZCMP_ZCMP_MASK)
#define QEIV2_ZCMP_ZCMP_GET(x) (((uint32_t)(x) & QEIV2_ZCMP_ZCMP_MASK) >> QEIV2_ZCMP_ZCMP_SHIFT)

/* Bitfield definition for register: PHCMP */
/*
 * PHCMP (RW)
 *
 * phcnt position compare value
 */
#define QEIV2_PHCMP_PHCMP_MASK (0xFFFFFFFFUL)
#define QEIV2_PHCMP_PHCMP_SHIFT (0U)
#define QEIV2_PHCMP_PHCMP_SET(x) (((uint32_t)(x) << QEIV2_PHCMP_PHCMP_SHIFT) & QEIV2_PHCMP_PHCMP_MASK)
#define QEIV2_PHCMP_PHCMP_GET(x) (((uint32_t)(x) & QEIV2_PHCMP_PHCMP_MASK) >> QEIV2_PHCMP_PHCMP_SHIFT)

/* Bitfield definition for register: SPDCMP */
/*
 * SPDCMP (RW)
 *
 * spdcnt position compare value
 */
#define QEIV2_SPDCMP_SPDCMP_MASK (0xFFFFFFFFUL)
#define QEIV2_SPDCMP_SPDCMP_SHIFT (0U)
#define QEIV2_SPDCMP_SPDCMP_SET(x) (((uint32_t)(x) << QEIV2_SPDCMP_SPDCMP_SHIFT) & QEIV2_SPDCMP_SPDCMP_MASK)
#define QEIV2_SPDCMP_SPDCMP_GET(x) (((uint32_t)(x) & QEIV2_SPDCMP_SPDCMP_MASK) >> QEIV2_SPDCMP_SPDCMP_SHIFT)

/* Bitfield definition for register: DMAEN */
/*
 * WDGFEN (RW)
 *
 * 1- generate dma request when wdg flag set
 */
#define QEIV2_DMAEN_WDGFEN_MASK (0x80000000UL)
#define QEIV2_DMAEN_WDGFEN_SHIFT (31U)
#define QEIV2_DMAEN_WDGFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_WDGFEN_SHIFT) & QEIV2_DMAEN_WDGFEN_MASK)
#define QEIV2_DMAEN_WDGFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_WDGFEN_MASK) >> QEIV2_DMAEN_WDGFEN_SHIFT)

/*
 * HOMEFEN (RW)
 *
 * 1- generate dma request when homef flag set
 */
#define QEIV2_DMAEN_HOMEFEN_MASK (0x40000000UL)
#define QEIV2_DMAEN_HOMEFEN_SHIFT (30U)
#define QEIV2_DMAEN_HOMEFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_HOMEFEN_SHIFT) & QEIV2_DMAEN_HOMEFEN_MASK)
#define QEIV2_DMAEN_HOMEFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_HOMEFEN_MASK) >> QEIV2_DMAEN_HOMEFEN_SHIFT)

/*
 * POSCMPFEN (RW)
 *
 * 1- generate dma request when poscmpf flag set
 */
#define QEIV2_DMAEN_POSCMPFEN_MASK (0x20000000UL)
#define QEIV2_DMAEN_POSCMPFEN_SHIFT (29U)
#define QEIV2_DMAEN_POSCMPFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_POSCMPFEN_SHIFT) & QEIV2_DMAEN_POSCMPFEN_MASK)
#define QEIV2_DMAEN_POSCMPFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_POSCMPFEN_MASK) >> QEIV2_DMAEN_POSCMPFEN_SHIFT)

/*
 * ZPHFEN (RW)
 *
 * 1- generate dma request when zphf flag set
 */
#define QEIV2_DMAEN_ZPHFEN_MASK (0x10000000UL)
#define QEIV2_DMAEN_ZPHFEN_SHIFT (28U)
#define QEIV2_DMAEN_ZPHFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_ZPHFEN_SHIFT) & QEIV2_DMAEN_ZPHFEN_MASK)
#define QEIV2_DMAEN_ZPHFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_ZPHFEN_MASK) >> QEIV2_DMAEN_ZPHFEN_SHIFT)

/*
 * ZMISSFEN (RW)
 *
 */
#define QEIV2_DMAEN_ZMISSFEN_MASK (0x8000000UL)
#define QEIV2_DMAEN_ZMISSFEN_SHIFT (27U)
#define QEIV2_DMAEN_ZMISSFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_ZMISSFEN_SHIFT) & QEIV2_DMAEN_ZMISSFEN_MASK)
#define QEIV2_DMAEN_ZMISSFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_ZMISSFEN_MASK) >> QEIV2_DMAEN_ZMISSFEN_SHIFT)

/*
 * WIDTHTMFEN (RW)
 *
 */
#define QEIV2_DMAEN_WIDTHTMFEN_MASK (0x4000000UL)
#define QEIV2_DMAEN_WIDTHTMFEN_SHIFT (26U)
#define QEIV2_DMAEN_WIDTHTMFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_WIDTHTMFEN_SHIFT) & QEIV2_DMAEN_WIDTHTMFEN_MASK)
#define QEIV2_DMAEN_WIDTHTMFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_WIDTHTMFEN_MASK) >> QEIV2_DMAEN_WIDTHTMFEN_SHIFT)

/*
 * POS2CMPFEN (RW)
 *
 */
#define QEIV2_DMAEN_POS2CMPFEN_MASK (0x2000000UL)
#define QEIV2_DMAEN_POS2CMPFEN_SHIFT (25U)
#define QEIV2_DMAEN_POS2CMPFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_POS2CMPFEN_SHIFT) & QEIV2_DMAEN_POS2CMPFEN_MASK)
#define QEIV2_DMAEN_POS2CMPFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_POS2CMPFEN_MASK) >> QEIV2_DMAEN_POS2CMPFEN_SHIFT)

/*
 * DIRCHGFEN (RW)
 *
 */
#define QEIV2_DMAEN_DIRCHGFEN_MASK (0x1000000UL)
#define QEIV2_DMAEN_DIRCHGFEN_SHIFT (24U)
#define QEIV2_DMAEN_DIRCHGFEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_DIRCHGFEN_SHIFT) & QEIV2_DMAEN_DIRCHGFEN_MASK)
#define QEIV2_DMAEN_DIRCHGFEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_DIRCHGFEN_MASK) >> QEIV2_DMAEN_DIRCHGFEN_SHIFT)

/*
 * CYCLE0FEN (RW)
 *
 */
#define QEIV2_DMAEN_CYCLE0FEN_MASK (0x800000UL)
#define QEIV2_DMAEN_CYCLE0FEN_SHIFT (23U)
#define QEIV2_DMAEN_CYCLE0FEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_CYCLE0FEN_SHIFT) & QEIV2_DMAEN_CYCLE0FEN_MASK)
#define QEIV2_DMAEN_CYCLE0FEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_CYCLE0FEN_MASK) >> QEIV2_DMAEN_CYCLE0FEN_SHIFT)

/*
 * CYCLE1FEN (RW)
 *
 */
#define QEIV2_DMAEN_CYCLE1FEN_MASK (0x400000UL)
#define QEIV2_DMAEN_CYCLE1FEN_SHIFT (22U)
#define QEIV2_DMAEN_CYCLE1FEN_SET(x) (((uint32_t)(x) << QEIV2_DMAEN_CYCLE1FEN_SHIFT) & QEIV2_DMAEN_CYCLE1FEN_MASK)
#define QEIV2_DMAEN_CYCLE1FEN_GET(x) (((uint32_t)(x) & QEIV2_DMAEN_CYCLE1FEN_MASK) >> QEIV2_DMAEN_CYCLE1FEN_SHIFT)

