hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_qeiv2_regs.h
/*
 * ASTAT (RO)
 *
 * 1- a input is high
 * 0- a input is low
 */
#define QEIV2_COUNT_SPD_ASTAT_MASK (0x40000000UL)
#define QEIV2_COUNT_SPD_ASTAT_SHIFT (30U)
#define QEIV2_COUNT_SPD_ASTAT_GET(x) (((uint32_t)(x) & QEIV2_COUNT_SPD_ASTAT_MASK) >> QEIV2_COUNT_SPD_ASTAT_SHIFT)

/*
 * BSTAT (RW)
 *
 * 1- b input is high
 * 0- b input is low
 */
#define QEIV2_COUNT_SPD_BSTAT_MASK (0x20000000UL)
#define QEIV2_COUNT_SPD_BSTAT_SHIFT (29U)
#define QEIV2_COUNT_SPD_BSTAT_SET(x) (((uint32_t)(x) << QEIV2_COUNT_SPD_BSTAT_SHIFT) & QEIV2_COUNT_SPD_BSTAT_MASK)
#define QEIV2_COUNT_SPD_BSTAT_GET(x) (((uint32_t)(x) & QEIV2_COUNT_SPD_BSTAT_MASK) >> QEIV2_COUNT_SPD_BSTAT_SHIFT)

/*
 * SPDCNT (RO)
 *
 * spdcnt value
 */
#define QEIV2_COUNT_SPD_SPDCNT_MASK (0xFFFFFFFUL)
#define QEIV2_COUNT_SPD_SPDCNT_SHIFT (0U)
#define QEIV2_COUNT_SPD_SPDCNT_GET(x) (((uint32_t)(x) & QEIV2_COUNT_SPD_SPDCNT_MASK) >> QEIV2_COUNT_SPD_SPDCNT_SHIFT)

/* Bitfield definition for register of struct array COUNT: TMR */
/*
 * TMRCNT (RO)
 *
 * 32 bit free run timer
 */
#define QEIV2_COUNT_TMR_TMRCNT_MASK (0xFFFFFFFFUL)
#define QEIV2_COUNT_TMR_TMRCNT_SHIFT (0U)
#define QEIV2_COUNT_TMR_TMRCNT_GET(x) (((uint32_t)(x) & QEIV2_COUNT_TMR_TMRCNT_MASK) >> QEIV2_COUNT_TMR_TMRCNT_SHIFT)

/* Bitfield definition for register: ZCMP2 */
/*
 * ZCMP2 (RW)
 *
 */
#define QEIV2_ZCMP2_ZCMP2_MASK (0xFFFFFFFFUL)
#define QEIV2_ZCMP2_ZCMP2_SHIFT (0U)
#define QEIV2_ZCMP2_ZCMP2_SET(x) (((uint32_t)(x) << QEIV2_ZCMP2_ZCMP2_SHIFT) & QEIV2_ZCMP2_ZCMP2_MASK)
#define QEIV2_ZCMP2_ZCMP2_GET(x) (((uint32_t)(x) & QEIV2_ZCMP2_ZCMP2_MASK) >> QEIV2_ZCMP2_ZCMP2_SHIFT)

/* Bitfield definition for register: PHCMP2 */
/*
 * PHCMP2 (RW)
 *
 */
#define QEIV2_PHCMP2_PHCMP2_MASK (0xFFFFFFFFUL)
#define QEIV2_PHCMP2_PHCMP2_SHIFT (0U)
#define QEIV2_PHCMP2_PHCMP2_SET(x) (((uint32_t)(x) << QEIV2_PHCMP2_PHCMP2_SHIFT) & QEIV2_PHCMP2_PHCMP2_MASK)
#define QEIV2_PHCMP2_PHCMP2_GET(x) (((uint32_t)(x) & QEIV2_PHCMP2_PHCMP2_MASK) >> QEIV2_PHCMP2_PHCMP2_SHIFT)

/* Bitfield definition for register: SPDCMP2 */
/*
 * SPDCMP2 (RW)
 *
 */
#define QEIV2_SPDCMP2_SPDCMP2_MASK (0xFFFFFFFFUL)
#define QEIV2_SPDCMP2_SPDCMP2_SHIFT (0U)
#define QEIV2_SPDCMP2_SPDCMP2_SET(x) (((uint32_t)(x) << QEIV2_SPDCMP2_SPDCMP2_SHIFT) & QEIV2_SPDCMP2_SPDCMP2_MASK)
#define QEIV2_SPDCMP2_SPDCMP2_GET(x) (((uint32_t)(x) & QEIV2_SPDCMP2_SPDCMP2_MASK) >> QEIV2_SPDCMP2_SPDCMP2_SHIFT)

/* Bitfield definition for register: MATCH_CFG */
/*
 * ZCMPDIS (RW)
 *
 * 1- postion compare not include zcnt
 */
#define QEIV2_MATCH_CFG_ZCMPDIS_MASK (0x80000000UL)
#define QEIV2_MATCH_CFG_ZCMPDIS_SHIFT (31U)
#define QEIV2_MATCH_CFG_ZCMPDIS_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_ZCMPDIS_SHIFT) & QEIV2_MATCH_CFG_ZCMPDIS_MASK)
#define QEIV2_MATCH_CFG_ZCMPDIS_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_ZCMPDIS_MASK) >> QEIV2_MATCH_CFG_ZCMPDIS_SHIFT)

/*
 * DIRCMPDIS (RW)
 *
 * 1- postion compare not include rotation direction
 */
#define QEIV2_MATCH_CFG_DIRCMPDIS_MASK (0x40000000UL)
#define QEIV2_MATCH_CFG_DIRCMPDIS_SHIFT (30U)
#define QEIV2_MATCH_CFG_DIRCMPDIS_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_DIRCMPDIS_SHIFT) & QEIV2_MATCH_CFG_DIRCMPDIS_MASK)
#define QEIV2_MATCH_CFG_DIRCMPDIS_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_DIRCMPDIS_MASK) >> QEIV2_MATCH_CFG_DIRCMPDIS_SHIFT)

/*
 * DIRCMP (RW)
 *
 * 0- position compare need positive rotation
 * 1- position compare need negative rotation
 */
#define QEIV2_MATCH_CFG_DIRCMP_MASK (0x20000000UL)
#define QEIV2_MATCH_CFG_DIRCMP_SHIFT (29U)
#define QEIV2_MATCH_CFG_DIRCMP_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_DIRCMP_SHIFT) & QEIV2_MATCH_CFG_DIRCMP_MASK)
#define QEIV2_MATCH_CFG_DIRCMP_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_DIRCMP_MASK) >> QEIV2_MATCH_CFG_DIRCMP_SHIFT)

/*
 * SPDCMPDIS (RW)
 *
 */
#define QEIV2_MATCH_CFG_SPDCMPDIS_MASK (0x10000000UL)
#define QEIV2_MATCH_CFG_SPDCMPDIS_SHIFT (28U)
#define QEIV2_MATCH_CFG_SPDCMPDIS_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_SPDCMPDIS_SHIFT) & QEIV2_MATCH_CFG_SPDCMPDIS_MASK)
#define QEIV2_MATCH_CFG_SPDCMPDIS_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_SPDCMPDIS_MASK) >> QEIV2_MATCH_CFG_SPDCMPDIS_SHIFT)

/*
 * PHASE_MATCH_DIS (RW)
 *
 */
#define QEIV2_MATCH_CFG_PHASE_MATCH_DIS_MASK (0x8000000UL)
#define QEIV2_MATCH_CFG_PHASE_MATCH_DIS_SHIFT (27U)
#define QEIV2_MATCH_CFG_PHASE_MATCH_DIS_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_PHASE_MATCH_DIS_SHIFT) & QEIV2_MATCH_CFG_PHASE_MATCH_DIS_MASK)
#define QEIV2_MATCH_CFG_PHASE_MATCH_DIS_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_PHASE_MATCH_DIS_MASK) >> QEIV2_MATCH_CFG_PHASE_MATCH_DIS_SHIFT)

/*
 * POS_MATCH_DIR (RW)
 *
 */
#define QEIV2_MATCH_CFG_POS_MATCH_DIR_MASK (0x4000000UL)
#define QEIV2_MATCH_CFG_POS_MATCH_DIR_SHIFT (26U)
#define QEIV2_MATCH_CFG_POS_MATCH_DIR_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_POS_MATCH_DIR_SHIFT) & QEIV2_MATCH_CFG_POS_MATCH_DIR_MASK)
#define QEIV2_MATCH_CFG_POS_MATCH_DIR_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_POS_MATCH_DIR_MASK) >> QEIV2_MATCH_CFG_POS_MATCH_DIR_SHIFT)

/*
 * POS_MATCH_OPT (RW)
 *
 */
#define QEIV2_MATCH_CFG_POS_MATCH_OPT_MASK (0x2000000UL)
#define QEIV2_MATCH_CFG_POS_MATCH_OPT_SHIFT (25U)
#define QEIV2_MATCH_CFG_POS_MATCH_OPT_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_POS_MATCH_OPT_SHIFT) & QEIV2_MATCH_CFG_POS_MATCH_OPT_MASK)
#define QEIV2_MATCH_CFG_POS_MATCH_OPT_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_POS_MATCH_OPT_MASK) >> QEIV2_MATCH_CFG_POS_MATCH_OPT_SHIFT)

/*
 * ZCMP2DIS (RW)
 *
 */
#define QEIV2_MATCH_CFG_ZCMP2DIS_MASK (0x8000U)
#define QEIV2_MATCH_CFG_ZCMP2DIS_SHIFT (15U)
#define QEIV2_MATCH_CFG_ZCMP2DIS_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_ZCMP2DIS_SHIFT) & QEIV2_MATCH_CFG_ZCMP2DIS_MASK)
#define QEIV2_MATCH_CFG_ZCMP2DIS_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_ZCMP2DIS_MASK) >> QEIV2_MATCH_CFG_ZCMP2DIS_SHIFT)

/*
 * DIRCMP2DIS (RW)
 *
 */
#define QEIV2_MATCH_CFG_DIRCMP2DIS_MASK (0x4000U)
#define QEIV2_MATCH_CFG_DIRCMP2DIS_SHIFT (14U)
#define QEIV2_MATCH_CFG_DIRCMP2DIS_SET(x) (((uint32_t)(x) << QEIV2_MATCH_CFG_DIRCMP2DIS_SHIFT) & QEIV2_MATCH_CFG_DIRCMP2DIS_MASK)
#define QEIV2_MATCH_CFG_DIRCMP2DIS_GET(x) (((uint32_t)(x) & QEIV2_MATCH_CFG_DIRCMP2DIS_MASK) >> QEIV2_MATCH_CFG_DIRCMP2DIS_SHIFT)

