hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_qeiv2_regs.h
/*
 * PULSE1_ONESHOT (RW)
 *
 */
#define QEIV2_QEI_CFG_PULSE1_ONESHOT_MASK (0x40000UL)
#define QEIV2_QEI_CFG_PULSE1_ONESHOT_SHIFT (18U)
#define QEIV2_QEI_CFG_PULSE1_ONESHOT_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_PULSE1_ONESHOT_SHIFT) & QEIV2_QEI_CFG_PULSE1_ONESHOT_MASK)
#define QEIV2_QEI_CFG_PULSE1_ONESHOT_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_PULSE1_ONESHOT_MASK) >> QEIV2_QEI_CFG_PULSE1_ONESHOT_SHIFT)

/*
 * CYCLE0_ONESHOT (RW)
 *
 * set to use oneshot mode for configed cycle_num
 */
#define QEIV2_QEI_CFG_CYCLE0_ONESHOT_MASK (0x20000UL)
#define QEIV2_QEI_CFG_CYCLE0_ONESHOT_SHIFT (17U)
#define QEIV2_QEI_CFG_CYCLE0_ONESHOT_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_CYCLE0_ONESHOT_SHIFT) & QEIV2_QEI_CFG_CYCLE0_ONESHOT_MASK)
#define QEIV2_QEI_CFG_CYCLE0_ONESHOT_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_CYCLE0_ONESHOT_MASK) >> QEIV2_QEI_CFG_CYCLE0_ONESHOT_SHIFT)

/*
 * CYCLE1_ONESHOT (RW)
 *
 */
#define QEIV2_QEI_CFG_CYCLE1_ONESHOT_MASK (0x10000UL)
#define QEIV2_QEI_CFG_CYCLE1_ONESHOT_SHIFT (16U)
#define QEIV2_QEI_CFG_CYCLE1_ONESHOT_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_CYCLE1_ONESHOT_SHIFT) & QEIV2_QEI_CFG_CYCLE1_ONESHOT_MASK)
#define QEIV2_QEI_CFG_CYCLE1_ONESHOT_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_CYCLE1_ONESHOT_MASK) >> QEIV2_QEI_CFG_CYCLE1_ONESHOT_SHIFT)

/*
 * SPEED_DIR_CHG_EN (RW)
 *
 * clear counter if detect direction change
 */
#define QEIV2_QEI_CFG_SPEED_DIR_CHG_EN_MASK (0x1000U)
#define QEIV2_QEI_CFG_SPEED_DIR_CHG_EN_SHIFT (12U)
#define QEIV2_QEI_CFG_SPEED_DIR_CHG_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SPEED_DIR_CHG_EN_SHIFT) & QEIV2_QEI_CFG_SPEED_DIR_CHG_EN_MASK)
#define QEIV2_QEI_CFG_SPEED_DIR_CHG_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SPEED_DIR_CHG_EN_MASK) >> QEIV2_QEI_CFG_SPEED_DIR_CHG_EN_SHIFT)

/*
 * TRIG_PULSE0_EN (RW)
 *
 * set to enable trigger start cycle counter for configed pulse_num(from the selected edge)
 */
#define QEIV2_QEI_CFG_TRIG_PULSE0_EN_MASK (0x800U)
#define QEIV2_QEI_CFG_TRIG_PULSE0_EN_SHIFT (11U)
#define QEIV2_QEI_CFG_TRIG_PULSE0_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_TRIG_PULSE0_EN_SHIFT) & QEIV2_QEI_CFG_TRIG_PULSE0_EN_MASK)
#define QEIV2_QEI_CFG_TRIG_PULSE0_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_TRIG_PULSE0_EN_MASK) >> QEIV2_QEI_CFG_TRIG_PULSE0_EN_SHIFT)

/*
 * TRIG_PULSE1_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_TRIG_PULSE1_EN_MASK (0x400U)
#define QEIV2_QEI_CFG_TRIG_PULSE1_EN_SHIFT (10U)
#define QEIV2_QEI_CFG_TRIG_PULSE1_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_TRIG_PULSE1_EN_SHIFT) & QEIV2_QEI_CFG_TRIG_PULSE1_EN_MASK)
#define QEIV2_QEI_CFG_TRIG_PULSE1_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_TRIG_PULSE1_EN_MASK) >> QEIV2_QEI_CFG_TRIG_PULSE1_EN_SHIFT)

/*
 * TRIG_CYCLE0_EN (RW)
 *
 * set to enable trigger start pulse counter for configed cycle_num
 */
#define QEIV2_QEI_CFG_TRIG_CYCLE0_EN_MASK (0x200U)
#define QEIV2_QEI_CFG_TRIG_CYCLE0_EN_SHIFT (9U)
#define QEIV2_QEI_CFG_TRIG_CYCLE0_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_TRIG_CYCLE0_EN_SHIFT) & QEIV2_QEI_CFG_TRIG_CYCLE0_EN_MASK)
#define QEIV2_QEI_CFG_TRIG_CYCLE0_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_TRIG_CYCLE0_EN_MASK) >> QEIV2_QEI_CFG_TRIG_CYCLE0_EN_SHIFT)

/*
 * TRIG_CYCLE1_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_TRIG_CYCLE1_EN_MASK (0x100U)
#define QEIV2_QEI_CFG_TRIG_CYCLE1_EN_SHIFT (8U)
#define QEIV2_QEI_CFG_TRIG_CYCLE1_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_TRIG_CYCLE1_EN_SHIFT) & QEIV2_QEI_CFG_TRIG_CYCLE1_EN_MASK)
#define QEIV2_QEI_CFG_TRIG_CYCLE1_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_TRIG_CYCLE1_EN_MASK) >> QEIV2_QEI_CFG_TRIG_CYCLE1_EN_SHIFT)

/*
 * UVW_POS_OPT0 (RW)
 *
 * set to output next area position for QEO use;
 * clr to output exact point position for MMC use
 */
#define QEIV2_QEI_CFG_UVW_POS_OPT0_MASK (0x20U)
#define QEIV2_QEI_CFG_UVW_POS_OPT0_SHIFT (5U)
#define QEIV2_QEI_CFG_UVW_POS_OPT0_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_UVW_POS_OPT0_SHIFT) & QEIV2_QEI_CFG_UVW_POS_OPT0_MASK)
#define QEIV2_QEI_CFG_UVW_POS_OPT0_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_UVW_POS_OPT0_MASK) >> QEIV2_QEI_CFG_UVW_POS_OPT0_SHIFT)

/*
 * NEGEDGE_EN (RW)
 *
 * bit4:  negedge enable
 * bit3:  posedge enable
 * bit2:  W in hal enable
 * bit1:  signal b(or V in hal) enable
 * bit0:  signal a(or U in hal) enable
 * such as:
 * 01001:  use posedge A
 * 11010:  use both edge of signal B
 * 11111:  use both edge of all HAL siganls
 */
#define QEIV2_QEI_CFG_NEGEDGE_EN_MASK (0x10U)
#define QEIV2_QEI_CFG_NEGEDGE_EN_SHIFT (4U)
#define QEIV2_QEI_CFG_NEGEDGE_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_NEGEDGE_EN_SHIFT) & QEIV2_QEI_CFG_NEGEDGE_EN_MASK)
#define QEIV2_QEI_CFG_NEGEDGE_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_NEGEDGE_EN_MASK) >> QEIV2_QEI_CFG_NEGEDGE_EN_SHIFT)

/*
 * POSIDGE_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_POSIDGE_EN_MASK (0x8U)
#define QEIV2_QEI_CFG_POSIDGE_EN_SHIFT (3U)
#define QEIV2_QEI_CFG_POSIDGE_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_POSIDGE_EN_SHIFT) & QEIV2_QEI_CFG_POSIDGE_EN_MASK)
#define QEIV2_QEI_CFG_POSIDGE_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_POSIDGE_EN_MASK) >> QEIV2_QEI_CFG_POSIDGE_EN_SHIFT)

/*
 * SIGZ_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_SIGZ_EN_MASK (0x4U)
#define QEIV2_QEI_CFG_SIGZ_EN_SHIFT (2U)
#define QEIV2_QEI_CFG_SIGZ_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SIGZ_EN_SHIFT) & QEIV2_QEI_CFG_SIGZ_EN_MASK)
#define QEIV2_QEI_CFG_SIGZ_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SIGZ_EN_MASK) >> QEIV2_QEI_CFG_SIGZ_EN_SHIFT)

/*
 * SIGB_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_SIGB_EN_MASK (0x2U)
#define QEIV2_QEI_CFG_SIGB_EN_SHIFT (1U)
#define QEIV2_QEI_CFG_SIGB_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SIGB_EN_SHIFT) & QEIV2_QEI_CFG_SIGB_EN_MASK)
#define QEIV2_QEI_CFG_SIGB_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SIGB_EN_MASK) >> QEIV2_QEI_CFG_SIGB_EN_SHIFT)

/*
 * SIGA_EN (RW)
 *
 */
#define QEIV2_QEI_CFG_SIGA_EN_MASK (0x1U)
#define QEIV2_QEI_CFG_SIGA_EN_SHIFT (0U)
#define QEIV2_QEI_CFG_SIGA_EN_SET(x) (((uint32_t)(x) << QEIV2_QEI_CFG_SIGA_EN_SHIFT) & QEIV2_QEI_CFG_SIGA_EN_MASK)
#define QEIV2_QEI_CFG_SIGA_EN_GET(x) (((uint32_t)(x) & QEIV2_QEI_CFG_SIGA_EN_MASK) >> QEIV2_QEI_CFG_SIGA_EN_SHIFT)

/* Bitfield definition for register: PULSE0_NUM */
/*
 * PULSE0_NUM (RW)
 *
 * for speed detection, will count the cycle number for configed pulse_num
 */
#define QEIV2_PULSE0_NUM_PULSE0_NUM_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE0_NUM_PULSE0_NUM_SHIFT (0U)
#define QEIV2_PULSE0_NUM_PULSE0_NUM_SET(x) (((uint32_t)(x) << QEIV2_PULSE0_NUM_PULSE0_NUM_SHIFT) & QEIV2_PULSE0_NUM_PULSE0_NUM_MASK)
#define QEIV2_PULSE0_NUM_PULSE0_NUM_GET(x) (((uint32_t)(x) & QEIV2_PULSE0_NUM_PULSE0_NUM_MASK) >> QEIV2_PULSE0_NUM_PULSE0_NUM_SHIFT)

/* Bitfield definition for register: PULSE1_NUM */
/*
 * PULSE1_NUM (RW)
 *
 */
#define QEIV2_PULSE1_NUM_PULSE1_NUM_MASK (0xFFFFFFFFUL)
#define QEIV2_PULSE1_NUM_PULSE1_NUM_SHIFT (0U)
#define QEIV2_PULSE1_NUM_PULSE1_NUM_SET(x) (((uint32_t)(x) << QEIV2_PULSE1_NUM_PULSE1_NUM_SHIFT) & QEIV2_PULSE1_NUM_PULSE1_NUM_MASK)
#define QEIV2_PULSE1_NUM_PULSE1_NUM_GET(x) (((uint32_t)(x) & QEIV2_PULSE1_NUM_PULSE1_NUM_MASK) >> QEIV2_PULSE1_NUM_PULSE1_NUM_SHIFT)

/* Bitfield definition for register: CYCLE0_CNT */
/*
 * CYCLE0_CNT (RO)
 *
 */
#define QEIV2_CYCLE0_CNT_CYCLE0_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE0_CNT_CYCLE0_CNT_SHIFT (0U)
#define QEIV2_CYCLE0_CNT_CYCLE0_CNT_GET(x) (((uint32_t)(x) & QEIV2_CYCLE0_CNT_CYCLE0_CNT_MASK) >> QEIV2_CYCLE0_CNT_CYCLE0_CNT_SHIFT)

/* Bitfield definition for register: CYCLE0PULSE_CNT */
/*
 * CYCLE0PULSE_CNT (RO)
 *
 */
#define QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_SHIFT (0U)
#define QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_GET(x) (((uint32_t)(x) & QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_MASK) >> QEIV2_CYCLE0PULSE_CNT_CYCLE0PULSE_CNT_SHIFT)

/* Bitfield definition for register: CYCLE1_CNT */
/*
 * CYCLE1_CNT (RO)
 *
 */
#define QEIV2_CYCLE1_CNT_CYCLE1_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE1_CNT_CYCLE1_CNT_SHIFT (0U)
#define QEIV2_CYCLE1_CNT_CYCLE1_CNT_GET(x) (((uint32_t)(x) & QEIV2_CYCLE1_CNT_CYCLE1_CNT_MASK) >> QEIV2_CYCLE1_CNT_CYCLE1_CNT_SHIFT)

/* Bitfield definition for register: CYCLE1PULSE_CNT */
/*
 * CYCLE1PULSE_CNT (RO)
 *
 */
#define QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_MASK (0xFFFFFFFFUL)
#define QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_SHIFT (0U)
#define QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_GET(x) (((uint32_t)(x) & QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_MASK) >> QEIV2_CYCLE1PULSE_CNT_CYCLE1PULSE_CNT_SHIFT)

