hpmicro/hpm_sdk/soc/HPM6P00/ip/hpm_qeiv2_regs.h
/* Bitfield definition for register: POSITION_UPDATE */
/*
 * INC (WO)
 *
 * set to add value to position
 */
#define QEIV2_POSITION_UPDATE_INC_MASK (0x80000000UL)
#define QEIV2_POSITION_UPDATE_INC_SHIFT (31U)
#define QEIV2_POSITION_UPDATE_INC_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_INC_SHIFT) & QEIV2_POSITION_UPDATE_INC_MASK)
#define QEIV2_POSITION_UPDATE_INC_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_INC_MASK) >> QEIV2_POSITION_UPDATE_INC_SHIFT)

/*
 * DEC (WO)
 *
 * set to minus value from position(set inc and dec same time willl act inc)
 */
#define QEIV2_POSITION_UPDATE_DEC_MASK (0x40000000UL)
#define QEIV2_POSITION_UPDATE_DEC_SHIFT (30U)
#define QEIV2_POSITION_UPDATE_DEC_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_DEC_SHIFT) & QEIV2_POSITION_UPDATE_DEC_MASK)
#define QEIV2_POSITION_UPDATE_DEC_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_DEC_MASK) >> QEIV2_POSITION_UPDATE_DEC_SHIFT)

/*
 * VALUE (WO)
 *
 * value to be added or minus from position. only valid when inc or dec is set in one 32bit write operation
 */
#define QEIV2_POSITION_UPDATE_VALUE_MASK (0x3FFFFFFFUL)
#define QEIV2_POSITION_UPDATE_VALUE_SHIFT (0U)
#define QEIV2_POSITION_UPDATE_VALUE_SET(x) (((uint32_t)(x) << QEIV2_POSITION_UPDATE_VALUE_SHIFT) & QEIV2_POSITION_UPDATE_VALUE_MASK)
#define QEIV2_POSITION_UPDATE_VALUE_GET(x) (((uint32_t)(x) & QEIV2_POSITION_UPDATE_VALUE_MASK) >> QEIV2_POSITION_UPDATE_VALUE_SHIFT)

/* Bitfield definition for register: ANGLE */
/*
 * ANGLE (RO)
 *
 */
#define QEIV2_ANGLE_ANGLE_MASK (0xFFFFFFFFUL)
#define QEIV2_ANGLE_ANGLE_SHIFT (0U)
#define QEIV2_ANGLE_ANGLE_GET(x) (((uint32_t)(x) & QEIV2_ANGLE_ANGLE_MASK) >> QEIV2_ANGLE_ANGLE_SHIFT)

/* Bitfield definition for register: POS_TIMEOUT */
/*
 * ENABLE (RW)
 *
 * enable position timeout feature, if timeout, send valid again
 */
#define QEIV2_POS_TIMEOUT_ENABLE_MASK (0x80000000UL)
#define QEIV2_POS_TIMEOUT_ENABLE_SHIFT (31U)
#define QEIV2_POS_TIMEOUT_ENABLE_SET(x) (((uint32_t)(x) << QEIV2_POS_TIMEOUT_ENABLE_SHIFT) & QEIV2_POS_TIMEOUT_ENABLE_MASK)
#define QEIV2_POS_TIMEOUT_ENABLE_GET(x) (((uint32_t)(x) & QEIV2_POS_TIMEOUT_ENABLE_MASK) >> QEIV2_POS_TIMEOUT_ENABLE_SHIFT)

/*
 * TIMEOUT (RW)
 *
 * postion timeout value
 */
#define QEIV2_POS_TIMEOUT_TIMEOUT_MASK (0x7FFFFFFFUL)
#define QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT (0U)
#define QEIV2_POS_TIMEOUT_TIMEOUT_SET(x) (((uint32_t)(x) << QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT) & QEIV2_POS_TIMEOUT_TIMEOUT_MASK)
#define QEIV2_POS_TIMEOUT_TIMEOUT_GET(x) (((uint32_t)(x) & QEIV2_POS_TIMEOUT_TIMEOUT_MASK) >> QEIV2_POS_TIMEOUT_TIMEOUT_SHIFT)

/* Bitfield definition for register: TOGI_CFG0 */
/*
 * SIN_TOGI (RW)
 *
 * set to use TOGI architecture for single SIN input
 */
#define QEIV2_TOGI_CFG0_SIN_TOGI_MASK (0x80000000UL)
#define QEIV2_TOGI_CFG0_SIN_TOGI_SHIFT (31U)
#define QEIV2_TOGI_CFG0_SIN_TOGI_SET(x) (((uint32_t)(x) << QEIV2_TOGI_CFG0_SIN_TOGI_SHIFT) & QEIV2_TOGI_CFG0_SIN_TOGI_MASK)
#define QEIV2_TOGI_CFG0_SIN_TOGI_GET(x) (((uint32_t)(x) & QEIV2_TOGI_CFG0_SIN_TOGI_MASK) >> QEIV2_TOGI_CFG0_SIN_TOGI_SHIFT)

/* Bitfield definition for register: TOGI_CFG1 */
/*
 * W_PARAM (RW)
 *
 * w_param is angle speed, which is  2*PI*signal_hz/adc_sample_rate*2^28.
 * for example, 50Hz signal with 1MHz ADC sample rate, angle speed is 2*3.14159*50/1000000*0x10000000,
 * which is 84331(0x1496B, default value)
 * if 50Hz with 2MHz sample rate, should config to 0xA4B6
 */
#define QEIV2_TOGI_CFG1_W_PARAM_MASK (0xFFFFFFFUL)
#define QEIV2_TOGI_CFG1_W_PARAM_SHIFT (0U)
#define QEIV2_TOGI_CFG1_W_PARAM_SET(x) (((uint32_t)(x) << QEIV2_TOGI_CFG1_W_PARAM_SHIFT) & QEIV2_TOGI_CFG1_W_PARAM_MASK)
#define QEIV2_TOGI_CFG1_W_PARAM_GET(x) (((uint32_t)(x) & QEIV2_TOGI_CFG1_W_PARAM_MASK) >> QEIV2_TOGI_CFG1_W_PARAM_SHIFT)

/* Bitfield definition for register: SINP_ACC */
/*
 * SINP_ACC (RO)
 *
 * positive SIN value acc in one period, updated when calculated SIN from pos to neg.
 * each SIN value is 16bit unsinged value(0x8000 for SIN30(0.5) )
 */
#define QEIV2_SINP_ACC_SINP_ACC_MASK (0xFFFFFFFFUL)
#define QEIV2_SINP_ACC_SINP_ACC_SHIFT (0U)
#define QEIV2_SINP_ACC_SINP_ACC_GET(x) (((uint32_t)(x) & QEIV2_SINP_ACC_SINP_ACC_MASK) >> QEIV2_SINP_ACC_SINP_ACC_SHIFT)

/* Bitfield definition for register: SINN_ACC */
/*
 * SINN_ACC (RO)
 *
 * negative SIN value acc in one period, updated when calculated SIN from neg to pos
 * each SIN value is 16bit unsinged value(0x8000 for SIN330(-0.5) )
 */
#define QEIV2_SINN_ACC_SINN_ACC_MASK (0xFFFFFFFFUL)
#define QEIV2_SINN_ACC_SINN_ACC_SHIFT (0U)
#define QEIV2_SINN_ACC_SINN_ACC_GET(x) (((uint32_t)(x) & QEIV2_SINN_ACC_SINN_ACC_MASK) >> QEIV2_SINN_ACC_SINN_ACC_SHIFT)

/* Bitfield definition for register: COSP_ACC */
/*
 * COSP_ACC (RO)
 *
 * positive COS value acc in one period, updated when calculated COS from pos to neg
 */
#define QEIV2_COSP_ACC_COSP_ACC_MASK (0xFFFFFFFFUL)
#define QEIV2_COSP_ACC_COSP_ACC_SHIFT (0U)
#define QEIV2_COSP_ACC_COSP_ACC_GET(x) (((uint32_t)(x) & QEIV2_COSP_ACC_COSP_ACC_MASK) >> QEIV2_COSP_ACC_COSP_ACC_SHIFT)

/* Bitfield definition for register: COSN_ACC */
/*
 * COSN_ACC (RO)
 *
 * negative COS value acc in one period, updated when calculated COS from neg to pos
 */
#define QEIV2_COSN_ACC_COSN_ACC_MASK (0xFFFFFFFFUL)
#define QEIV2_COSN_ACC_COSN_ACC_SHIFT (0U)
#define QEIV2_COSN_ACC_COSN_ACC_GET(x) (((uint32_t)(x) & QEIV2_COSN_ACC_COSN_ACC_MASK) >> QEIV2_COSN_ACC_COSN_ACC_SHIFT)



/* COUNT register group index macro definition */
#define QEIV2_COUNT_CURRENT (0UL)
#define QEIV2_COUNT_READ (1UL)
#define QEIV2_COUNT_SNAP0 (2UL)
#define QEIV2_COUNT_SNAP1 (3UL)

/* FILT_CFG register group index macro definition */
#define QEIV2_FILT_CFG_FILT_CFG_A (0UL)
#define QEIV2_FILT_CFG_FILT_CFG_B (1UL)
#define QEIV2_FILT_CFG_FILT_CFG_Z (2UL)
#define QEIV2_FILT_CFG_FILT_CFG_H (3UL)
#define QEIV2_FILT_CFG_FILT_CFG_H2 (4UL)
#define QEIV2_FILT_CFG_FILT_CFG_F (5UL)

/* UVW_POS register group index macro definition */
#define QEIV2_UVW_POS_UVW_POS0 (0UL)
#define QEIV2_UVW_POS_UVW_POS1 (1UL)
#define QEIV2_UVW_POS_UVW_POS2 (2UL)
#define QEIV2_UVW_POS_UVW_POS3 (3UL)
#define QEIV2_UVW_POS_UVW_POS4 (4UL)
#define QEIV2_UVW_POS_UVW_POS5 (5UL)

/* UVW_POS_CFG register group index macro definition */
#define QEIV2_UVW_POS_CFG_UVW_POS0_CFG (0UL)
#define QEIV2_UVW_POS_CFG_UVW_POS1_CFG (1UL)
#define QEIV2_UVW_POS_CFG_UVW_POS2_CFG (2UL)
#define QEIV2_UVW_POS_CFG_UVW_POS3_CFG (3UL)
#define QEIV2_UVW_POS_CFG_UVW_POS4_CFG (4UL)
#define QEIV2_UVW_POS_CFG_UVW_POS5_CFG (5UL)


#endif /* HPM_QEIV2_H */
